In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sn 
from  datetime import * 
import os

In [9]:
os.chdir(r'C:\Users\Familia\Documents\Projetos')
df.head()

     760\t25\t2009-11-06
0    860\t50\t2012-09-28
1  1200\t100\t2005-10-25
2   1420\t50\t2009-07-09
3   1940\t70\t2013-01-25
4   1960\t40\t2013-10-29

In [24]:
df = pd.read_csv('Src/Compras.txt' ,sep="\t",names=['cliente_id','valor_compra','data_compra'])
df.head()

   cliente_id  valor_compra data_compra
0         760          25.0  2009-11-06
1         860          50.0  2012-09-28
2        1200         100.0  2005-10-25
3        1420          50.0  2009-07-09
4        1940          70.0  2013-01-25

In [18]:
df.columns

Index(['760', '25', '2009-11-06'], dtype='object')

     760\t25\t2009-11-06
0    860\t50\t2012-09-28
1  1200\t100\t2005-10-25
2   1420\t50\t2009-07-09
3   1940\t70\t2013-01-25
4   1960\t40\t2013-10-29